spec/fixtures/vcr_cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_an_invalid_card/should_not_create_a_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000119&card[exp_month]=11&card[exp_year]=2020&card[cvc]=123
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer sk_test_rywASYMpka8DsWexRySEOYlb
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andrews-MBP.home 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21
        PST 2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"Andrews-MBP.home"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 10 Mar 2017 11:55:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AGIxTeJIXW1SFt
      Stripe-Version:
      - '2017-02-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_19vmLUEI3UfzsZ2pbw4RA1CR",
          "object": "token",
          "card": {
            "id": "card_19vmLUEI3UfzsZ2pjwrC3t96",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 11,
            "exp_year": 2020,
            "fingerprint": "5FDUghT65EYJtJbL",
            "funding": "credit",
            "last4": "0119",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "86.145.63.33",
          "created": 1489146944,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Fri, 10 Mar 2017 11:55:44 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=90&currency=usd&description=Test&source=tok_19vmLUEI3UfzsZ2pbw4RA1CR
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer sk_test_rywASYMpka8DsWexRySEOYlb
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Andrews-MBP.home 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21
        PST 2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"Andrews-MBP.home"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Fri, 10 Mar 2017 11:55:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '214'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AGIxwClsvbrSdJ
      Stripe-Version:
      - '2017-02-14'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "An error occurred while processing your card. Try again in a little bit.",
            "type": "card_error",
            "code": "processing_error",
            "charge": "ch_19vmLUEI3UfzsZ2p1JtuXBu0"
          }
        }
    http_version: 
  recorded_at: Fri, 10 Mar 2017 11:55:45 GMT
recorded_with: VCR 2.9.3
